In [ ]:
%load_ext rpy2.ipython

In [ ]:
%R require(gender)
%R require(genderdata)
%R require(tibble)

R[write to console]: Loading required package: gender

R[write to console]: Loading required package: genderdata

R[write to console]: Loading required package: tibble

<rpy2.robjects.vectors.BoolVector object> [RTYPES.LGLSXP]
R classes: ('logical',)
[       1]

In [ ]:
%matplotlib notebook

import pandas as pd
import numpy as np

import time
import pickle

import memory_profiler
%load_ext memory_profiler

from pathlib import Path

The memory_profiler extension is already loaded. To reload it, use:
  %reload_ext memory_profiler

In [ ]:
variables_path = Path('../variables')
figures_path = Path('../results/figures')
berenslab_data_path = Path('/gpfs01/berens/data/data/pubmed_processed')

In [ ]:
import black
import jupyter_black

jupyter_black.load(line_length=79)

In [ ]:
names = np.load("names.npy")

In [ ]:
dict_names = {'Names' : names }
df = pd.DataFrame(dict_names)
df

           Names
0              A
1             A.
2      ABULIKEMU
3             AJ
4           AJAY
...          ...
8933  zizhang.wu
8934       Đorđe
8935      Łukasz
8936          志勇
8937          雪枫

[8938 rows x 1 columns]

In [ ]:
df_names = df.Names
df_names

0                A
1               A.
2        ABULIKEMU
3               AJ
4             AJAY
           ...
8933    zizhang.wu
8934         Đorđe
8935        Łukasz
8936            志勇
8937            雪枫
Name: Names, Length: 8938, dtype: object

In [ ]:
%%time
%R library(gender)
%R -i df_names -o result result = gender(df_names, years = 2012, method = "ssa")

CPU times: user 338 ms, sys: 2.04 ms, total: 340 ms
Wall time: 338 ms

         name  proportion_male  proportion_female  gender  year_min  year_max
1     Aadarsh           1.0000             0.0000    male    2012.0    2012.0
2     Aaditya           1.0000             0.0000    male    2012.0    2012.0
3        Aaro           1.0000             0.0000    male    2012.0    2012.0
4       Aaron           0.9970             0.0030    male    2012.0    2012.0
5      Aayush           1.0000             0.0000    male    2012.0    2012.0
...       ...              ...                ...     ...       ...       ...
2337    Ziyan           0.4522             0.5478  female    2012.0    2012.0
2338      Zoe           0.0023             0.9977  female    2012.0    2012.0
2339    Zohar           0.5149             0.4851    male    2012.0    2012.0
2340    Zoran           1.0000             0.0000    male    2012.0    2012.0
2341      Zvi           1.0000             0.0000    male    2012.0    2012.0

[2341 rows x 6 columns]

In [ ]:
result

         name  proportion_male  proportion_female  gender  year_min  year_max
1     Aadarsh           1.0000             0.0000    male    2012.0    2012.0
2     Aaditya           1.0000             0.0000    male    2012.0    2012.0
3        Aaro           1.0000             0.0000    male    2012.0    2012.0
4       Aaron           0.9970             0.0030    male    2012.0    2012.0
5      Aayush           1.0000             0.0000    male    2012.0    2012.0
...       ...              ...                ...     ...       ...       ...
2337    Ziyan           0.4522             0.5478  female    2012.0    2012.0
2338      Zoe           0.0023             0.9977  female    2012.0    2012.0
2339    Zohar           0.5149             0.4851    male    2012.0    2012.0
2340    Zoran           1.0000             0.0000    male    2012.0    2012.0
2341      Zvi           1.0000             0.0000    male    2012.0    2012.0

[2341 rows x 6 columns]

In [ ]:
gender_map = dict(zip(result.name, result.gender))

In [ ]:
genders=np.vectorize(gender_map.get)(names)

In [ ]:
np.save('genders', genders)

In [ ]:
genders.shape

(8938,)

In [ ]:
print(np.sum([genders != None]))
print(np.sum([genders == 'female']))
print(np.sum([genders == 'male']))

2341
670
1671

In [ ]:
2341/8938*100

26.19154173193108

In [ ]:
1e6-0.01*1e6

990000.0